/*
	char값 연산시 +,-만 가능 *,/은 불가

	문자열 저장을 위해 char배열 사용
*/

//성적 관리 프로그램 (배열을 쓰지 않고 변수만을 이용)

#include <stdio.h>

int main()
{
	//학생 a, b
	//1 : 수학, 2 : 과학, 3 : 영어

	int i_a1, i_a2, i_a3;
	int i_b1, i_b2, i_b3;

	char c_a1, c_a2, c_a3;
	char c_b1, c_b2, c_b3;

	//성적 데이터 입력
	scanf_s("%d %d %d", &i_a1, &i_a2, &i_a3);
	scanf_s("%d %d %d", &i_b1, &i_b2, &i_b3);

	//90이상 : A, 80 ~ 89 : B, 70 ~ 79 : C, 69이하 : D
	if ((i_a1 >= 90) || (i_b1 >= 90))
	{
		if (i_a1 >= 90)
			c_a1 = 'A';
		if (i_b1 >= 90)
			c_b1 = 'A';
	}
	if (((80 <= i_a1) && (i_a1 < 90)) || ((80 <= i_b1) && (i_b1 < 90)))
	{
		if (((80 <= i_a1) && (i_a1 < 90)) != 0)
			c_a1 = 'B';
		if (((80 <= i_b1) && (i_b1 < 90)) != 0)
			c_b1 = 'B';
	}
	if (((70 <= i_a1) && (i_a1 < 80)) || ((70 <= i_b1) && (i_b1 < 80)))
	{
		if (((70 <= i_a1) && (i_a1 < 80)) != 0)
			c_a1 = 'C';
		if (((70 <= i_b1) && (i_b1 < 80)) != 0)
			c_b1 = 'C';
	}
	if (i_a1 < 70 || i_b1 < 70)
	{
		if (i_a1 < 70)
			c_a1 = 'D';
		if (i_b1 < 70)
			c_b1 = 'D';
	}

	//90이상 : A, 80 ~ 89 : B, 70 ~ 79 : C, 69이하 : D
	if ((i_a2 >= 90) || (i_b2 >= 90))
	{
		if (i_a2 >= 90)
			c_a2 = 'A';
		if (i_b2 >= 90)
			c_b2 = 'A';
	}
	if (((80 <= i_a2) && (i_a2 < 90)) || ((80 <= i_b2) && (i_b2 < 90)))
	{
		if (((80 <= i_a2) && (i_a2 < 90)) != 0)
			c_a2 = 'B';
		if (((80 <= i_b2) && (i_b2 < 90)) != 0)
			c_b2 = 'B';
	}
	if (((70 <= i_a2) && (i_a2 < 80)) || ((70 <= i_b2) && (i_b2 < 80)))
	{
		if (((70 <= i_a2) && (i_a2 < 80)) != 0)
			c_a2 = 'C';
		if (((70 <= i_b2) && (i_b2 < 80)) != 0)
			c_b2 = 'C';
	}
	if (i_a2 < 70 || i_b2 < 70)
	{
		if (i_a2 < 70)
			c_a2 = 'D';
		if (i_b2 < 70)
			c_b2 = 'D';
	}

	//90이상 : A, 80 ~ 89 : B, 70 ~ 79 : C, 69이하 : D
	if ((i_a3 >= 90) || (i_b3 >= 90))
	{
		if (i_a3 >= 90)
			c_a3 = 'A';
		if (i_b3 >= 90)
			c_b3 = 'A';
	}
	if (((80 <= i_a3) && (i_a3 < 90)) || ((80 <= i_b3) && (i_b3 < 90)))
	{
		if (((80 <= i_a3) && (i_a3 < 90)) != 0)
			c_a3 = 'B';
		if (((80 <= i_b3) && (i_b3 < 90)) != 0)
			c_b3 = 'B';
	}
	if (((70 <= i_a3) && (i_a3 < 80)) || ((70 <= i_b3) && (i_b3 < 80)))
	{
		if (((70 <= i_a3) && (i_a3 < 80)) != 0)
			c_a3 = 'C';
		if (((70 <= i_b3) && (i_b3 < 80)) != 0)
			c_b3 = 'C';
	}
	if (i_a3 < 70 || i_b3 < 70)
	{
		if (i_a3 < 70)
			c_a3 = 'D';
		if (i_b3 < 70)
			c_b3 = 'D';
	}

	double aver_a = (i_a1 + i_a2 + i_a3) / 3;
	double aver_b = (i_b1 + i_b2 + i_b3) / 3;

	printf("a1 : %c, a2 : %c, a3 : %c\n", c_a1, c_a2, c_a3);
	printf("b1 : %c, b2 : %c, b3 : %c\n", c_b1, c_b2, c_b3);

	printf("%f %f\n", aver_a, aver_b);
	

	return 0;
}